io-test.yml
config:
  target: "http://34.64.192.218/"
  phases:
    - duration: 60        # 초
      arrivalRate: 3      # 매 초 생성할 사용자 수
      name: Warm up
    - duration: 120
      arrivalRate: 3      # 매 초 생성할 사용자 수
      rampTo: 100
      name: Ramp up load
    - duration: 600
      arrivalRate: 100
      name: Sustained load
    payload:
      path: "ratings_test_10k.csv"
      fields:
        - "content"
scenarios:
  - name: "just post content"
    flow:
      - post:
          url: "/post"
          json:
            content: "{{ content }}"